sim/rhoReactingCentralFoam/10000_3_fixed/10000_3_1e-9/constant/reactions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
// 				SETUP
// Chemkin format uses these units:
// 	mol, cm^3, s, K; cal
// OpenFOAM native format uses:
// 	kmol, m^3, s, K; K
// The native format is what this file is using. 

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      reactions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

species
4
(
    O2
    H2
    H2O
    N2
);

reactions
{
    hydrogenReaction
    {
        type     irreversibleArrheniusReaction;
        reaction "2H2 + O2 = 2H2O";
		A		6.85e12; // from Colin Towery
        beta    0;
		Ta		13500; // from Colin Towery
    }
}


// ************************************************************************* //
